src/ПодсистемаPAPI/Catalogs/PAPI_ПодпискиНаСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>PAPI_ПодпискиНаСобытия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PAPI_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PAPI_ВнешняяОбработка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрешен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PAPI_ТипПодпискиНаСобытие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PAPI_ТипВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьВРежимеЗагрузкиДанных</Name>
					<Comment>Будет выполняться даже для объектов с признаком "ОбменДанными.Загрузка = Истина"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Источники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РодительИсточника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подписка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ПодсистемаPAPI/InformationRegisters/PAPI_ИсполнителиПодписок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>PAPI_ИсполнителиПодписок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PAPI_ТипВыполнения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсполняемыйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PAPI_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PAPI_ВнешняяОбработка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PAPI_ТипПодпискиНаСобытие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PAPI_ПодпискиНаСобытия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ПодсистемаPAPI/Catalogs/PAPI_ПодпискиНаСобытия/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий 

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда 
		
		Если Не ЭтоНовый() Тогда
			 
			Если Источники.Количество() > 0 Тогда  	
				PAPI_ОбщегоНазначенияВызовСервера.УбратьДублиВТабличнойЧасти(Источники, "Источник", Ложь); 
			КонецЕсли;
			
			// Передаем в чистку данные до изменения
			Если Ссылка.Источники.Количество() > 0 Тогда 
				ДополнительныеСвойства.Вставить("ИсточникиДляОчищения", Ссылка.Источники.Выгрузить());
				ДополнительныеСвойства.Вставить("СобытиеДоЗаписи",  Ссылка.Событие); 		
			КонецЕсли;
			
		КонецЕсли;     
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		// Очистить старые данные, если они были
		Если ДополнительныеСвойства.Свойство("ИсточникиДляОчищения") Тогда
			Для Каждого ДанныеДляОчистки Из ДополнительныеСвойства.ИсточникиДляОчищения Цикл
				РегистрыСведений.PAPI_ИсполнителиПодписок.ОчиститьЗаписиПоИзмерениям(
											ДанныеДляОчистки.Источник, ДополнительныеСвойства.СобытиеДоЗаписи, Ссылка
				);
			КонецЦикла;
		КонецЕсли;
		
		// Добавить новые данные
		Если ЭтотОбъект.Разрешен И Не ЭтотОбъект.ПометкаУдаления Тогда
			Для Каждого ДанныеНаДобавление Из Источники Цикл			
				РегистрыСведений.PAPI_ИсполнителиПодписок.ДобавитьЗапись(ДанныеНаДобавление.Источник, Событие, Ссылка);
			КонецЦикла;
		Иначе
			// Почистить все данные
			УдалитьВсеИсполнители();
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	УдалитьВсеИсполнители();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область Прочее

Процедура УдалитьВсеИсполнители()
	
	ВключенПривилегированныйРежим = Ложь;
	Если Не ПривилегированныйРежим() Тогда  
		ВключенПривилегированныйРежим = Истина;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);
	КонецЕсли;
	
	
	Если Не Метаданные.РегистрыСведений.Найти("PAPI_ИсполнителиПодписок") = Неопределено Тогда 
		РегистрыСведений.PAPI_ИсполнителиПодписок.УдалитьВсеИсполнители(Ссылка);	
	КонецЕсли;	
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.PAPI_ИсполнителиПодписок КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Подписка = &Подписка
	|");
	Запрос.УстановитьПараметр("Подписка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.PAPI_ИсполнителиПодписок.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.Удалить();
	КонецЦикла;
	
	Если ВключенПривилегированныйРежим Тогда 
		ВключенПривилегированныйРежим = Ложь;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти



#КонецЕсли
